
 IDENTIFICATION DIVISION.
   PROGRAM-ID.
     BABYSTEPS.
   AUTHOR.
   INSTALLATION.

 ENVIRONMENT DIVISION.
  CONFIGURATION SECTION.
    SOURCE-COMPUTER. MACBOOK-PRO.
    OBJECT-COMPUTER. MACBOOK-PRO.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT FILEN ASSIGN TO DDNAME
    ORGANIZATION IS SEQUENTIAL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
   77 CONST-PI           PICTURE Z.ZZZZZZZZZZZZZZZZZ.
   77 WORK-1             PICTURE ZZZZ.ZZ VALUE IS ZERO.
   77 WORK-2             PICTURE ZZZZ.ZZ VALUE IS ZERO.
   77 WORK-3             PICTURE ZZZZ.ZZ VALUE IS ZERO.
   01  PRINT-LINE.
       05  EDT-ID              PICTURE X(3) VALUE 'ABCDE'.
       05  FILLER              PICTURE X(11) VALUE ' Perimeter '.
       05  EDT-3-15-CIR        PICTURE ZZZ.ZZZZZZZZZZZZZZZ.
       05  FILLER              PICTURE X(08) VALUE ' Radius '.
       05  EDT-3-15-RAD        PICTURE ZZZ.ZZZZZZZZZZZZZZZ.
       05  FILLER              PICTURE X(04) VALUE ' Pi '.
       05  EDT-1-15-PI         PICTURE Z.ZZZZZZZZZZZZZZZZZ.
 LOCAL-STORAGE SECTION.
   LD LIB-DESCR.
 PROCEDURE DIVISION.
  A-PARA.
      MOVE 123.46 TO WORK-1.
      ADD  986.64 TO WORK-1 GIVING WORK-2.
      ADD  2 TO WORK-2.
      DIVIDE WORK-2 INTO 3 GIVING WORK-3.
      MULTIPLY WORK-2 BY 3 GIVING WORK-3.
      PERFORM C-PARA.

  B-PARA.
      MOVE PI TO CONST-PI
      MOVE 'HELLO' TO EDT-ID
      ADD CONST-PI  TO EDT-ID GIVING EDT-1-15-PI.
      STOP RUN.

  C-PARA.
      PERFORM B-PARA.
      DISPLAY 'PI IS: ' CONST-PI.
      DISPLAY PRINT-LINE.
